Revit 2026 API

# IDirectContext3DServerGetBoundingBox Method

---

Reports a bounding box of the geometry that this server submits for drawing.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
Outline GetBoundingBox(
	View dBView
)
```
```vb
Function GetBoundingBox (
	dBView As View
) As Outline
```
```cpp
Outline^ GetBoundingBox(
	View^ dBView
)
```
```fsharp
abstract GetBoundingBox :
        dBView : View -> Outline
```

#### Parameters

dBView View
     The view where rendering will occur. If this argument is , a view-independent bounding box should be reported.

#### Return Value

Outline The bounding box as an Outline.

Revit uses the bounding box when navigating views, e.g., when a Zoom to Fit command is issued. The reported bounding box does not have to be tight. However, there may be unintended side-effects if the box is inconsistent with the submitted geometry.

#### Reference

IDirectContext3DServer Interface

Autodesk.Revit.DB.DirectContext3D Namespace